index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-17 Sat 18:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gorgeous title should be here</title>
<meta name="author" content="Mikhail Efremov" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Gorgeous title should be here</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org59c945f">1. About</a></li>
<li><a href="#org748793d">2. Brief info about my toolkit and interests:</a>
<ul>
<li><a href="#orgf22126d">2.1. Hardware</a></li>
<li><a href="#org28abb18">2.2. Software</a>
<ul>
<li><a href="#orgf6e8efe">2.2.1. OSes</a></li>
<li><a href="#org296b41b">2.2.2. WMs/DE</a></li>
<li><a href="#org959c546">2.2.3. Editors</a></li>
<li><a href="#orgda8bf1f">2.2.4. Programming languages</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org068c20a">3. Topics and domains</a>
<ul>
<li><a href="#org70ce569">3.1. Distributed systems</a></li>
<li><a href="#org39de2dd">3.2. Reinforced Learning</a></li>
<li><a href="#orgb201dbe">3.3. Federated learning</a></li>
<li><a href="#orgca9d996">3.4. Emacs and Elisp</a></li>
</ul>
</li>
<li><a href="#orgd782f42">4. What are there?</a></li>
</ul>
</div>
</div>

<div id="outline-container-org59c945f" class="outline-2">
<h2 id="org59c945f"><span class="section-number-2">1.</span> About</h2>
<div class="outline-text-2" id="text-1">
<p>
Hello, here is the my contact and info page. My name is <b>Mikhail Efremov</b>, now I&rsquo;m kind of nomad. Have BS, MS and
finished, but not defended PhD in Software Engineering and CS. My research work was related to machine learning
approaches for swarm robotic foraging problem, then had evolved into federated learning, but now my most interested
domain is distributed DBMS. I&rsquo;m contributing in Apache Ignite 3 and love it.
</p>
</div>
</div>
<div id="outline-container-org748793d" class="outline-2">
<h2 id="org748793d"><span class="section-number-2">2.</span> Brief info about my toolkit and interests:</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf22126d" class="outline-3">
<h3 id="orgf22126d"><span class="section-number-3">2.1.</span> Hardware</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><del>Dell Inspirion N7110 since 2012. Love it.</del></li>
<li>Lenovo ThinkPad T480 with i5 CPU since 2019. Upgrading it. Use as slow laptop for cuncurrency bug fixing. Also
thinking about making it fully FOSS platform for server purposes. Mostly covered with dust now</li>
<li>MacBook M3Max 36Gb since 2024. Not a fan, but it gives best performance with autonomy in my nomadic life. Working horse.</li>
<li>Logitech Lift since 2024. Because wrists pain isn&rsquo;t a joke.</li>
<li>HHKB as input since 2025. I&rsquo;m afraid of mac&rsquo;s keayboard so I need something robust.</li>
</ul>
</div>
</div>
<div id="outline-container-org28abb18" class="outline-3">
<h3 id="org28abb18"><span class="section-number-3">2.2.</span> Software</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgf6e8efe" class="outline-4">
<h4 id="orgf6e8efe"><span class="section-number-4">2.2.1.</span> OSes</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li><del>Arch Linux as main OS since 2016. Love it too.</del></li>
<li><del>Fedora Workstation since 2020. Just works.</del></li>
<li><del>Ubuntu 22.** since 2022. Just works, but much longer.</del></li>
<li>Debian 12 since 2023. Just works, but much longer, without SNAPs or other corpo things. Works on T480.</li>
<li>MacOS 15 since 2024. Just works, I guess, mostly use as IDEA and Firefox launcher. Works on MacBook, obviously.</li>
</ul>
</div>
</div>
<div id="outline-container-org296b41b" class="outline-4">
<h4 id="org296b41b"><span class="section-number-4">2.2.2.</span> WMs/DE</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li><del>Custom workaround with i3-wm and vim-like utilities such as ranger.</del></li>
<li>GNOME 40+ and suits tools. Because Wayland without tearing.</li>
</ul>
</div>
</div>
<div id="outline-container-org959c546" class="outline-4">
<h4 id="org959c546"><span class="section-number-4">2.2.3.</span> Editors</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>JetBrains IDEA as Java developing. It&rsquo;s proprientary, it&rsquo;s paid but nothing better for Java yet. And this tool in
particular makes Java most pleasant programming language for me.</li>
<li>Emacs. Just curious. I tried it so many times since 2021, but sticks with it only when started to track job activities
through org-file. In potential I believe that Emacs may be better than VSCode in all dimentions, but it requires
crafting A LOT. DooM Emacs is just different editor, IMO, if you learned DooM Emacs it doesn&rsquo;t mean you learned
Emacs. Learning Elisp and wish to be a Lisp wizard.</li>
</ul>
</div>
</div>
<div id="outline-container-orgda8bf1f" class="outline-4">
<h4 id="orgda8bf1f"><span class="section-number-4">2.2.4.</span> Programming languages</h4>
<div class="outline-text-4" id="text-2-2-4">
<ul class="org-ul">
<li>Java. Love from school days and Horstmann&rsquo;s &ldquo;Core Java&rdquo; books. Did CS degree labs, PhD research, first job backends
and now Apache Ignite 3 with Java. I like that I shouldn&rsquo;t think about the language and use it as the most suit tool
for my real-world problems to solve.</li>
<li>All other languages like C/C++, Python, OCaml, Common Lisp, R and so on that I learned ages ago or tried once but forgot.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org068c20a" class="outline-2">
<h2 id="org068c20a"><span class="section-number-2">3.</span> Topics and domains</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org70ce569" class="outline-3">
<h3 id="org70ce569"><span class="section-number-3">3.1.</span> Distributed systems</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The ocean to discover.
</p>
</div>
</div>
<div id="outline-container-org39de2dd" class="outline-3">
<h3 id="org39de2dd"><span class="section-number-3">3.2.</span> Reinforced Learning</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The only ML domain that doesn&rsquo;t hype now because of complexity. But I believe that future of massive autonomous robots
swarms will be arised from there.
</p>
</div>
</div>
<div id="outline-container-orgb201dbe" class="outline-3">
<h3 id="orgb201dbe"><span class="section-number-3">3.3.</span> Federated learning</h3>
<div class="outline-text-3" id="text-3-3">
<p>
My PhD theme and again not too hyped tech that behind of your on-device AI things.
</p>
</div>
</div>
<div id="outline-container-orgca9d996" class="outline-3">
<h3 id="orgca9d996"><span class="section-number-3">3.4.</span> Emacs and Elisp</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Obsession and guilty pleasure, source of procrastinating. I believe that if there were interest from cool developers
with huge expirience and motivation we should already have an absolutely FOSS editor and IDE, most user-friendly and
blazing fast. But instead we have VSCode popularity. &ldquo;Persist in the doomed world you have created&rdquo;.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd782f42" class="outline-2">
<h2 id="orgd782f42"><span class="section-number-2">4.</span> What are there?</h2>
<div class="outline-text-2" id="text-4">
<p>
From er.. ages ago there was a pretty image of a teapot, but it weight several MBs. I removed it. Also I removed CSS and
this HTML is generated from the org file. I wish there will be kind of text blog about distributed algorithms and
emacs. Stay tuned. Still.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mikhail Efremov</p>
<p class="date">Created: 2025-05-17 Sat 18:34</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
